{
  "backend/main.mo": "Main Motoko actor implementing a party ledger system with authentication, party/payment management, visit records with location tracking, staff accounts, shop branding, and data import/export functionality using blob storage and access control mixins.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features that remove authentication checks from PartyFormDialog, ExcelPartyImportCard, and JsonTransferCard to allow unauthenticated users to create/import parties and data.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering authentication, queries, utilities, components, and pages with details about Internet Identity integration, React Query hooks, and routing configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes for UI components including sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for the Party Ledger application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring QueryClient, TanStack Router with routes for dashboard/parties/reports/settings/visits, Internet Identity authentication flow, profile setup dialog, and conditional rendering based on auth state.",
  "frontend/src/components/admin/AddAdminPrincipalDialog.tsx": "Dialog component for adding admin principals with Principal ID validation, form submission using useAddAdminPrincipal mutation, and error handling.",
  "frontend/src/components/admin/AdminPrincipalsPanel.tsx": "Admin panel component for managing admin principals with add/remove functionality, displays a table of admin users with their status and actions.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Empty file placeholder for staff management panel component.",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Alert dialog component that displays parties with payments due today, allowing navigation to individual party details.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen component displaying an access denied message with customizable reason for unauthorized users.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen component for application initialization failures with retry and reload options.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen component with Internet Identity authentication integration and branded UI.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Error screen specifically for profile loading failures with retry and reload functionality.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup, collecting user name and authenticating as staff.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Empty file placeholder for admin password reset dialog component.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Empty file placeholder for staff login screen component.",
  "frontend/src/components/auth/StartupLoadingScreen.tsx": "Simple loading screen component with spinner and customizable message for app startup.",
  "frontend/src/components/auth/TopLevelErrorBoundary.tsx": "React error boundary component that catches top-level errors and displays a self-contained error UI with reload option.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Header component displaying shop logo and name from branding settings with fallback defaults.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card for managing shop branding including name and logo upload with progress tracking using ExternalBlob.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Provides a UI card for importing parties from Excel files with batch processing, progress tracking, and error handling. Parses Excel data, generates party IDs, and adds parties in batches of 10 with detailed logging and result reporting.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout component with navigation bar, branding header, and footer. Includes navigation to Dashboard, Parties, New Visit, Reports, and Settings pages, plus logout functionality.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Dialog component for adding or editing party records with fields for name, address, phone, PAN, and due amount. Handles party ID generation for new parties and validation before submission.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog for recording payments with amount, comment, and optional next payment date fields. Requires next payment date when amount is zero and converts dates to timestamps before submission.",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment records with metadata including payment ID, next payment date indicator, and location saved status. Shows empty state when no payments exist.",
  "frontend/src/components/settings/PrincipalDisplayCard.tsx": "Card component that displays the user's Internet Identity Principal ID with copy-to-clipboard functionality. Used for sharing with administrators to grant access.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "Provides data export/import functionality via JSON files with options to either merge with existing data or overwrite all data. Handles file parsing, data merging, and error reporting.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog component for recording party visits with payment amount, comment, next payment date, visit datetime, and optional geolocation capture.",
  "frontend/src/context/ActorSessionContext.tsx": "React context provider that manages the backend actor instance, loading states, and provides a stable principal key for authenticated sessions.",
  "frontend/src/context/AppReadinessContext.tsx": "Empty file placeholder for app readiness context.",
  "frontend/src/context/StaffAuthContext.tsx": "Empty file placeholder for staff authentication context.",
  "frontend/src/hooks/queries/useAdminPrincipals.ts": "React Query hooks for managing admin principals including fetching, adding, removing admins, and checking caller admin status using extended actor interface.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the current user's profile (name) from the backend.",
  "frontend/src/hooks/queries/useBranding.ts": "React Query hooks for fetching and updating shop branding (name and logo) configuration.",
  "frontend/src/hooks/queries/useParties.ts": "React Query hooks for CRUD operations on parties including listing, fetching single party, validating/generating party IDs, and managing party data.",
  "frontend/src/hooks/queries/usePayments.ts": "React Query hooks for fetching party visit records and recording payments/visits with optional location data, invalidating related queries on success.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Empty file placeholder for staff admin query hooks.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "React Query hooks for fetching staff account permissions and authenticating staff members by login name.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "React Query hook that aggregates today's party visits across all parties, calculating total count and amount with auto-refresh.",
  "frontend/src/hooks/queries/useTransfer.ts": "React Query hooks for exporting and importing upgrade data with full query cache invalidation on import.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor instance for backend communication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Similar to useActor but returns additional loading/error states and a refetch function without invalidating other queries.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Simplified hook for managing due-today party alerts; currently disabled to avoid performance issues with a placeholder implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login, logout, and identity management with delegation validation.",
  "frontend/src/hooks/useStaffAuth.ts": "Empty file with no content.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "Parses CSV files to extract party data (name, address, phone, PAN, due amount) with validation and error reporting.",
  "frontend/src/lib/format.ts": "Utility functions for formatting and parsing money amounts, phone numbers, and PAN numbers.",
  "frontend/src/lib/phone.ts": "Utility functions to normalize phone numbers and create tel: links.",
  "frontend/src/lib/time.ts": "Utilities for converting between Date objects and backend Time (nanoseconds), formatting dates/times, and handling datetime-local inputs.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Functions to export/import UpgradeData as JSON files with bigint serialization and merge logic for combining datasets.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying today's visit count, total collected amount, and a list of visits with party details and navigation.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Page for creating new party visits with searchable party selection grid, displaying party details (name, phone, PAN, due amount) and opening a visit form dialog on party selection.",
  "frontend/src/pages/PartiesPage.tsx": "Main parties listing page with search functionality, add party button, and clickable party cards that navigate to party details; displays loading states and empty states.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Detailed party view page showing party information, payment history, and action buttons for editing, deleting, adding payments, and recording visits; includes confirmation dialogs for destructive actions.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page with party selector dropdown that displays party summary statistics (due amount, total payments) and latest payment details using full visit records.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with tabbed interface for profile, branding, import, data transfer, and conditional admin panel; uses role-based access control to show admin tab.",
  "frontend/src/pages/VisitDetailsPage.tsx": "Individual visit record detail page showing payment amount, visit date/time, comments, next payment date, and location information for a specific party visit.",
  "frontend/src/utils/staffSession.ts": "Empty utility file for staff session management (no content provided).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, font families, and animation keyframes for accordions.",
  "project_state.json": "Project state tracking document showing three completed features that removed authentication checks from PartyFormDialog, ExcelPartyImportCard, and JsonTransferCard components, with one pending request to remove authentication from login and import functionality."
}