{
  "backend/main.mo": "Main Motoko actor implementing a party ledger system with party management, payment tracking, location-based visit records, staff accounts, access control, and blob storage for shop branding.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, utilities, and pages describing authentication, party management, payment tracking, branding, reports, and admin features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including sidebar, chart, and UI component colors.",
  "frontend/index.html": "HTML entry point for the Party Ledger application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, Internet Identity authentication flow, actor session management, profile setup dialog, and route definitions for dashboard, parties, visits, reports, and settings.",
  "frontend/src/components/admin/AddAdminPrincipalDialog.tsx": "Dialog component for adding new admin principals with Principal ID validation and mutation handling.",
  "frontend/src/components/admin/AdminPrincipalsPanel.tsx": "Admin panel displaying list of admin principals with add/remove functionality, current user highlighting, and protection against removing the last admin.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Component for managing staff accounts (file content truncated).",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Dialog component that displays parties with payments due today, allowing users to view individual party details by navigating to the party page.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen component displaying an access denied message with an optional custom reason when users lack required permissions.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen shown when application initialization fails, providing retry and reload options.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen component that uses Internet Identity authentication with a branded card layout.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Error screen displayed when user profile loading fails, offering retry and reload functionality.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to enter their name during initial profile setup, preventing dismissal until completed.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Empty file placeholder for admin password reset dialog component.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Empty file placeholder for staff login screen component.",
  "frontend/src/components/auth/StartupLoadingScreen.tsx": "Simple loading screen with spinner and customizable message shown during application startup.",
  "frontend/src/components/auth/TopLevelErrorBoundary.tsx": "React error boundary component that catches top-level errors and displays a self-contained error UI with reload functionality.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Header component displaying shop logo and name from branding settings, with fallback to default values.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card for managing shop branding including name and logo upload with progress tracking using ExternalBlob.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Card component for importing parties from CSV files, parsing data, previewing errors, and batch-adding parties with ID generation.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell component providing navigation, header with branding, logout functionality, and footer. Renders navigation items for Dashboard, Parties, New Visit, Reports, and Settings with responsive design.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Dialog component for adding or editing party records with fields for name, address, phone, PAN, and due amount. Handles party ID generation for new parties and validation before submission.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog for recording payments with amount, comment, and optional next payment date fields. Requires next payment date when amount is zero and validates input before submission.",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment records with metadata including payment ID, next payment date indicator, and location saved status. Shows empty state when no payments exist.",
  "frontend/src/components/settings/PrincipalDisplayCard.tsx": "Card component displaying the user's Internet Identity Principal ID with copy-to-clipboard functionality. Shows authentication status and provides instructions for sharing with administrators.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "Card component for exporting and importing application data as JSON files. Supports merge and overwrite import modes for data transfer between devices.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog for recording party visits with payment amount, comment, visit date/time, next payment date, and automatic geolocation capture. Validates inputs and handles location permission states.",
  "frontend/src/context/ActorSessionContext.tsx": "Provides React context for managing backend actor session state, including loading states, errors, and a stable principal key for query invalidation.",
  "frontend/src/context/AppReadinessContext.tsx": "Empty file with no content.",
  "frontend/src/context/StaffAuthContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/queries/useAdminPrincipals.ts": "React Query hooks for managing admin principals (get, add, remove) and checking if the caller is an admin, with temporary type casting until backend interface is regenerated.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the current user's profile (name) with caching and invalidation.",
  "frontend/src/hooks/queries/useBranding.ts": "React Query hooks for getting and setting shop branding (name and logo) with cache invalidation.",
  "frontend/src/hooks/queries/useParties.ts": "React Query hooks for CRUD operations on parties (customers), including validation, ID generation, and fetching all or individual party records.",
  "frontend/src/hooks/queries/usePayments.ts": "React Query hooks for fetching party visit records and recording payments or visits with location data, invalidating related caches on success.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Empty file with no content.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "React Query hook for fetching staff account permissions by login name, with fallback handling for non-admin users.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "React Query hook that aggregates today's party visits across all parties, calculating total count and amount with automatic refresh every minute.",
  "frontend/src/hooks/queries/useTransfer.ts": "React Query hooks for exporting and importing upgrade data with cache invalidation on import.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication, initializing access control and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "React Query hook that creates the backend actor with retry logic and error handling, initializing access control with admin token from URL parameters.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Simplified hook for managing due-today alerts with dismissal state; full implementation disabled to avoid performance issues from fetching all party payment records.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useStaffAuth.ts": "Empty file, likely a placeholder for staff authentication logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like cards, buttons, borders, and charts.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "Parses CSV files to extract party data (name, address, phone, PAN, due amount) with validation and error reporting for bulk party imports.",
  "frontend/src/lib/format.ts": "Utility functions for formatting and parsing monetary amounts in Indian Rupees, phone numbers, and PAN numbers.",
  "frontend/src/lib/phone.ts": "Utility functions to normalize phone numbers and create tel: links for clickable phone numbers.",
  "frontend/src/lib/time.ts": "Time conversion utilities between JavaScript Date objects and ICP Time (nanoseconds), plus formatting functions for datetime-local inputs and display.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Handles JSON export/import of UpgradeData (parties, visit records, branding) with bigint serialization and merge logic for data transfer between canisters.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying today's visit summary statistics (count, total amount) and a list of all visits with party details and navigation.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Page for creating new party visits with searchable party list and dialog form for recording visit details when a party is selected.",
  "frontend/src/pages/PartiesPage.tsx": "Displays a searchable list of all parties with their basic info (name, phone, PAN, due amount) in a card grid layout. Includes functionality to add new parties via dialog and navigate to individual party details.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Shows detailed information for a single party including contact details, due amount, and payment history. Provides actions to edit, delete, call, record payments, and schedule party visits.",
  "frontend/src/pages/ReportsPage.tsx": "Displays payment analytics and history for a selected party, showing party summary (due amount, total payments) and latest payment details with visit information.",
  "frontend/src/pages/SettingsPage.tsx": "Tabbed settings interface with sections for profile, branding, Excel import, data transfer (JSON), and admin panel (conditionally shown for admin users).",
  "frontend/src/pages/VisitDetailsPage.tsx": "Displays detailed information about a specific party visit record including amount, date/time, comments, next payment date, and location with map link.",
  "frontend/src/utils/staffSession.ts": "Empty utility file, likely placeholder for staff session management functionality.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with container settings, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting an e-commerce shop with Internet Identity authentication, identifying admin Principal registration issues, and defining three pending feature requests to auto-register first user as admin, validate admin checks, and add debug logging."
}