{
  "backend/main.mo": "Main Motoko actor implementing a party ledger system with CRUD operations for parties, payments, visit records, shop branding, user profiles, and access control with admin/user/staff roles.",
  "feature_evidence.json": "Feature evidence report documenting a high-confidence feature to remove duplicate party name displays in UI components across dashboard, calendar, and payment history views.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering routing, hooks, utilities, components, and pages with implementation details for party management, payments, authentication, and UI features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including sidebar, chart, and UI component colors.",
  "frontend/index.html": "HTML entry point with Leaflet map library and MarkerCluster plugin CSS imports for geolocation features.",
  "frontend/src/App.tsx": "Root React application component configuring TanStack Router with routes for dashboard, parties, reports, settings, visits, and map, wrapped in theme, query client, and actor session providers.",
  "frontend/src/components/admin/AddAdminPrincipalDialog.tsx": "Dialog component for adding new admin principals with Principal ID validation and mutation handling.",
  "frontend/src/components/admin/AdminPrincipalsPanel.tsx": "Admin panel displaying list of admin principals with add/remove functionality, enforcing at least one admin must remain in the system.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Component for managing staff users with access control features (content truncated in source).",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Alert dialog component that displays parties with payments due today, allowing users to view party details by clicking on them or navigating to the party page.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen component that displays an access denied message with an optional custom reason when users lack required permissions.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen shown when application initialization fails, providing retry and page reload options.",
  "frontend/src/components/auth/LoginScreen.tsx": "Landing page with Internet Identity login button for authenticating users into the Party Ledger application.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Error screen displayed when user profile loading fails, offering retry and reload functionality.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to set up their profile by entering their name, which cannot be dismissed until completed.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Empty file placeholder for admin password reset dialog component.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Empty file placeholder for staff-specific login screen component.",
  "frontend/src/components/auth/StartupLoadingScreen.tsx": "Simple loading screen with spinner and customizable message displayed during application startup.",
  "frontend/src/components/auth/TopLevelErrorBoundary.tsx": "React error boundary that catches top-level errors and displays a self-contained error UI with reload functionality, independent of app providers.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Header component displaying shop logo and name from branding settings, with fallback to default Party Ledger branding.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card for customizing shop name and logo with image upload functionality, progress tracking, and toast notifications for success/error states.",
  "frontend/src/components/dashboard/TodayNotifications.tsx": "Dashboard card displaying parties with payments due today, featuring quick call buttons and navigation to party details or advanced reports.",
  "frontend/src/components/dashboard/UpcomingPaymentsCalendar.tsx": "Displays a calendar-based view of upcoming payments with date selection, showing parties with payments due on the selected date. Includes phone call links and navigation to party details.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Provides UI for importing parties from Excel/CSV files with preview, batch processing (10 at a time), progress tracking, and detailed success/failure reporting.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout shell with navigation menu (Dashboard, Parties, New Visit, Map, Reports, Settings), logout functionality, and branded footer with caffeine.ai attribution.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Modal dialog for adding or editing party information (name, address, phone, PAN, due amount) with automatic party ID generation and validation.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Modal dialog for recording payments with amount, comment, and optional next payment date (required when amount is 0).",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment records with metadata indicators for location tracking and next payment dates.",
  "frontend/src/components/settings/PrincipalDisplayCard.tsx": "Shows the user's Internet Identity Principal ID with copy-to-clipboard functionality for sharing with administrators.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "React component providing UI for exporting and importing application data as JSON, with options to merge or overwrite existing data.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog component for recording party visits with payment amount, date/time, next payment date, comments, and automatic geolocation capture.",
  "frontend/src/context/ActorSessionContext.tsx": "React context providing actor session state (backend interface, loading states, errors) and a stable principal key for query invalidation.",
  "frontend/src/context/AppReadinessContext.tsx": "Empty file, likely a placeholder for application readiness state management.",
  "frontend/src/context/StaffAuthContext.tsx": "Empty file, likely a placeholder for staff authentication context.",
  "frontend/src/hooks/queries/useAdminPrincipals.ts": "React Query hooks for managing admin principals (get, add, remove) and checking caller admin status, with temporary type extensions for unregenerated backend methods.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the caller's user profile using the actor session.",
  "frontend/src/hooks/queries/useBranding.ts": "React Query hooks for getting and setting shop branding (name and logo) with caching and invalidation.",
  "frontend/src/hooks/queries/useMapLocationData.ts": "React Query hook that fetches party visit location data with optional date filtering, processing visits with geolocation coordinates for map display.",
  "frontend/src/hooks/queries/useParties.ts": "React Query hooks for party management including fetching all parties, getting individual party details, validating/generating party IDs, and adding parties with comprehensive error handling.",
  "frontend/src/hooks/queries/usePayments.ts": "Provides React Query hooks for fetching party payment records (useGetPayments), recording payments (useRecordPayment), and recording party visits with location data (useRecordPartyVisit), with automatic cache invalidation across multiple related queries.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Empty file with no content.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "Stub file indicating staff authentication has been removed; exports no-op hooks for backward compatibility.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "Provides a React Query hook that aggregates today's visit records across all parties, returning visits sorted by payment date with total count and amount.",
  "frontend/src/hooks/queries/useTodayNotifications.ts": "Fetches parties with payments due today, enriching the data with party names and phone numbers, with automatic refetch every minute.",
  "frontend/src/hooks/queries/useTransfer.ts": "Provides mutation hooks for exporting and importing upgrade data, with cache invalidation on successful import.",
  "frontend/src/hooks/queries/useUpcomingPayments.ts": "Fetches parties with next payment dates matching a selected date (defaults to today), extracting the most recent next payment date from visit records.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Similar to useActor but with explicit error handling and retry logic, providing loading/error states without automatic query invalidation.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Simplified stub hook for due-today alerts with dismissal functionality; actual implementation disabled to avoid performance issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validity checking with configurable AuthClient options.",
  "frontend/src/hooks/useStaffAuth.ts": "Empty file with no content.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, muted, destructive, and chart colors using oklch color space.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "Parses CSV files to extract party data (name, address, phone, PAN, due amount) with validation for required fields, field lengths, and data formats. Returns parsed parties and any validation errors encountered during processing.",
  "frontend/src/lib/format.ts": "Provides formatting and parsing utilities for money (bigint to/from Indian Rupee strings), phone numbers, and PAN numbers with fallback to 'N/A' for empty values.",
  "frontend/src/lib/phone.ts": "Normalizes phone numbers by removing whitespace and creates tel: protocol links for phone number dialing.",
  "frontend/src/lib/time.ts": "Converts between JavaScript Date objects and backend Time (bigint nanoseconds), formats dates/times for display, and handles datetime-local input string conversions.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Handles JSON export/import of UpgradeData with bigint serialization, file downloads, and merging of imported data with existing parties and visit records.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/DashboardPage.tsx": "Displays a dashboard with today's visit statistics, notifications, upcoming payments calendar, and a list of recent visits with party details and amounts.",
  "frontend/src/pages/MapPage.tsx": "Renders an interactive Leaflet map with marker clustering showing party visit locations, with date range filtering and dynamic data loading from the backend.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Provides a searchable party selection interface for creating new visits, displaying party cards with details and opening a visit form dialog on selection.",
  "frontend/src/pages/PartiesPage.tsx": "Displays a searchable grid of party cards with filtering by name/phone/PAN, loading skeletons, and a dialog to add new parties. Clicking a card navigates to party details.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Shows detailed information for a single party including contact info, balance, and payment history with options to edit, delete, add payments, or record visits.",
  "frontend/src/pages/ReportsPage.tsx": "Advanced analytics page that displays comprehensive payment history and statistics for a selected party, including total paid, average payment, and location/date tracking metrics.",
  "frontend/src/pages/SettingsPage.tsx": "Tabbed settings interface with sections for profile, branding, Excel import, data transfer, and an admin panel (conditionally shown for admin users).",
  "frontend/src/pages/VisitDetailsPage.tsx": "Displays detailed information about a specific party visit/payment record including amount, date/time, comments, next payment date, and location with map link.",
  "frontend/src/utils/staffSession.ts": "Empty utility file for staff session management (no implementation present).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, container settings, border radius variables, Inter font family, accordion animations, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking a fix request to remove duplicate party name displays in the UI, with one existing feature and one pending feature request (AR-1)."
}