{
  "backend/main.mo": "Main Motoko actor implementing a party ledger system with CRUD operations for parties, payments, visit records, user profiles, shop branding, and location-based filtering. Includes authorization mixins, blob storage, and data export/import functionality.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: updating project_state.json to reflect migration completion, regenerating frontend-file-summaries.txt to remove password references, and adding a visual note for minimum admin requirement.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing React components, hooks, utilities, and pages for a party ledger application with Internet Identity authentication, payment tracking, and shop branding features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, charts, and semantic tokens like primary, secondary, destructive, and muted.",
  "frontend/index.html": "HTML entry point for the Party Ledger application, including Leaflet map library and MarkerCluster plugin CSS imports for map functionality.",
  "frontend/src/App.tsx": "Root React component configuring React Query, TanStack Router with routes for dashboard, parties, reports, settings, visits, and map pages, wrapped in theme, actor session, and error boundary providers.",
  "frontend/src/components/admin/AddAdminPrincipalDialog.tsx": "Dialog component for adding new admin principals with Principal ID validation, form submission handling, and loading states using the useAddAdminPrincipal mutation hook.",
  "frontend/src/components/admin/AdminPrincipalsPanel.tsx": "Admin panel component for managing admin principals with add/remove functionality, displays table of admin users with their principal IDs and status badges.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Empty file placeholder for staff management panel component.",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Alert dialog component that displays parties with payments due today, allowing users to view individual party details.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen component displaying an access denied message with customizable reason for unauthorized users.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen component for application initialization failures with retry and reload options.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen component with Internet Identity authentication integration and branded card layout.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Error screen specifically for profile loading failures with retry and reload functionality.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup, collecting user name with form validation.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Empty file placeholder for admin password reset dialog component.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Empty file placeholder for staff-specific login screen component.",
  "frontend/src/components/auth/StartupLoadingScreen.tsx": "Simple loading screen component with spinner and customizable message for application startup.",
  "frontend/src/components/auth/TopLevelErrorBoundary.tsx": "React error boundary component that catches top-level errors and displays a self-contained error UI with reload option.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Header component displaying shop logo and name from branding settings with fallback defaults.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card component for managing shop branding including name and logo upload with progress tracking.",
  "frontend/src/components/dashboard/TodayNotifications.tsx": "Displays a card showing parties with payments due today, with call and navigation buttons for each party. Includes loading and empty states with appropriate messaging.",
  "frontend/src/components/dashboard/UpcomingPaymentsCalendar.tsx": "Calendar-based payment reminder component with date picker that shows parties with payments due on a selected date. Includes today button, date formatting, and party navigation with call functionality.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Card component for bulk importing parties from Excel/CSV files with preview, batch processing (10 at a time), progress tracking, and success/failure reporting. Generates party IDs and handles validation during import.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout shell with navigation bar (Dashboard, Parties, New Visit, Map, Reports, Settings), logout functionality, branding header, and footer with caffeine.ai attribution.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Dialog form for adding or editing party details (name, address, phone, PAN, due amount) with automatic party ID generation for new parties and validation for required fields.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog form for recording payments with amount, comment, and optional next payment date fields. Requires next payment date when amount is zero and validates accordingly.",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment records with payment ID, next payment date indicator, and location data status. Shows an empty state message when no payments exist.",
  "frontend/src/components/settings/PrincipalDisplayCard.tsx": "Card component that displays the user's Internet Identity Principal ID with a copy-to-clipboard button. Provides instructions for sharing the ID with administrators for access grants.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "Provides UI for exporting all application data to JSON and importing JSON data with options to merge or overwrite existing records. Uses custom hooks for data transfer operations.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog form for recording party visits with amount, comment, visit date/time, next payment date, and automatic geolocation capture. Validates that next payment date is required when amount is zero.",
  "frontend/src/context/ActorSessionContext.tsx": "React context that provides the backend actor instance, loading states, and a stable principal key for query invalidation. Wraps the useActorSafe hook for application-wide actor access.",
  "frontend/src/context/AppReadinessContext.tsx": "Empty file placeholder for application readiness context.",
  "frontend/src/context/StaffAuthContext.tsx": "Empty file placeholder for staff authentication context.",
  "frontend/src/hooks/queries/useAdminPrincipals.ts": "React Query hooks for managing admin principals including fetching the list, adding/removing principals, and checking if the caller is an admin. Uses temporary type extensions until backend interface is regenerated.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the current user's profile (name). Manages query caching and invalidation for user profile data.",
  "frontend/src/hooks/queries/useBranding.ts": "React Query hooks for fetching and updating shop branding (name and logo). Handles caching and invalidation of branding data.",
  "frontend/src/hooks/queries/useMapLocationData.ts": "React Query hook that fetches party visit location data for map display, filtering by date range and requiring location coordinates. Processes party details and validates coordinates for each visit with location data.",
  "frontend/src/hooks/queries/useParties.ts": "Provides React Query hooks for party management: fetching all parties, fetching a single party by ID, validating and generating party IDs with detailed logging, and adding/updating/deleting parties with cache invalidation.",
  "frontend/src/hooks/queries/usePayments.ts": "Provides React Query hooks for payment operations: fetching party visit records, recording payments, and recording party visits with location data, all with automatic cache invalidation across related queries.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Empty file with no content.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "Stub file indicating staff authentication has been removed; exports no-op hooks for backward compatibility.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "Provides a React Query hook that aggregates today's visit records across all parties, returning visits sorted by date with total count and amount, refreshing every minute.",
  "frontend/src/hooks/queries/useTodayNotifications.ts": "Provides a React Query hook that fetches parties with payments due today, enriching them with party names and phone numbers, with automatic minute-based refresh.",
  "frontend/src/hooks/queries/useTransfer.ts": "Provides React Query mutation hooks for exporting and importing upgrade data, with cache invalidation on import to refresh all party, payment, and dashboard queries.",
  "frontend/src/hooks/queries/useUpcomingPayments.ts": "Provides a React Query hook that fetches parties with payments due on a selected date by examining visit records for next payment dates, sorted by party name.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Similar to useActor but provides additional error handling, loading states, and retry logic without automatic query invalidation on actor changes.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Simplified stub hook for due-today alerts with dismissal functionality; full implementation disabled to avoid performance issues from fetching all party payment records.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useStaffAuth.ts": "Empty file with no content.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like cards, buttons, borders, and charts.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "CSV parser that reads party data from uploaded files, validates required fields (Party Name, PAN), optional fields (address, phone, due amount), and returns parsed parties with error messages for invalid rows.",
  "frontend/src/lib/format.ts": "Utility functions for formatting and parsing monetary amounts (with Indian Rupee symbol and locale), phone numbers, and PAN numbers.",
  "frontend/src/lib/phone.ts": "Helper functions to normalize phone numbers and create tel: links for clickable phone numbers.",
  "frontend/src/lib/time.ts": "Time conversion utilities between JavaScript Date objects and ICP Time (nanosecond bigints), plus formatting functions for datetime-local inputs and display strings.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Functions to export/import UpgradeData as JSON files with bigint serialization, and merge imported data with existing parties and visit records.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying today's visit summary statistics, notifications, upcoming payments calendar, and a list of recent visits with party details and payment amounts.",
  "frontend/src/pages/MapPage.tsx": "Map visualization page using Leaflet and MarkerCluster to display party visit locations with date range filtering, dynamically loading map libraries from CDN and rendering location markers.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Page for selecting a party to record a new visit, with search functionality and a grid of party cards that open a visit form dialog when clicked.",
  "frontend/src/pages/PartiesPage.tsx": "Main parties listing page with search, filtering, and add party functionality; displays parties in a grid with click-through to detail pages.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Detailed view of a single party showing information, payment history, and actions (edit, delete, add payment, record visit) with confirmation dialogs.",
  "frontend/src/pages/ReportsPage.tsx": "Advanced analytics page that displays detailed payment history and statistics for a selected party, including location tracking and payment trends.",
  "frontend/src/pages/SettingsPage.tsx": "Tabbed settings page with sections for profile, branding, data import, data transfer, and admin panel (conditionally shown for admin users).",
  "frontend/src/pages/VisitDetailsPage.tsx": "Displays detailed information about a specific party visit including amount, date/time, comments, next payment date, and location with map link.",
  "frontend/src/utils/staffSession.ts": "Empty utility file for staff session management (no content provided).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for an Admin Management System migration from password-based to Internet Identity Principal-based access control, listing architectural notes, known issues with outdated bindings, and pending feature requests for completing the password purge and dead code cleanup."
}