{
  "backend/main.mo": "Main actor implementing party ledger system with CRUD operations for parties, payments, visit records, shop branding, user profiles, and access control using mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module that cleans duplicate party entries by ensuring each partyId exists only once in the parties map during actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: an all-parties list page and a duplicate parties investigation/resolution page with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering hooks, utilities, components, and pages with implementation details and optimizations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes including color schemes for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point loading Leaflet map library with MarkerCluster plugin for map visualization features.",
  "frontend/src/App.tsx": "Root application component configuring React Query, TanStack Router with routes for dashboard, parties, reports, settings, visits, map, all-parties list, and duplicates pages, wrapped in theme and actor session providers.",
  "frontend/src/components/admin/AddAdminPrincipalDialog.tsx": "Dialog component for adding admin principals with Principal ID validation, form handling, and mutation integration using useAddAdminPrincipal hook.",
  "frontend/src/components/admin/AdminPrincipalsPanel.tsx": "Admin panel component for managing admin principals with add/remove functionality, displays table of admin users with their principal IDs and status badges.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Empty file placeholder for staff management panel component.",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Alert dialog component that displays parties with payments due today, allowing navigation to individual party details.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen component displaying an access denied message with customizable reason for unauthorized users.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen component for application initialization failures with retry and reload options.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen component with Internet Identity authentication integration and branded card layout.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Error screen specifically for profile loading failures with retry and reload functionality.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup, collecting user name with form validation.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Empty file placeholder for admin password reset dialog component.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Empty file placeholder for staff-specific login screen component.",
  "frontend/src/components/auth/StartupLoadingScreen.tsx": "Simple loading screen component with spinner and customizable message for application startup.",
  "frontend/src/components/auth/TopLevelErrorBoundary.tsx": "React error boundary component that catches top-level errors and displays a self-contained error UI with reload option.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Header component displaying shop logo and name from branding settings with fallback defaults.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card for managing shop branding including name and logo upload with progress tracking using ExternalBlob.",
  "frontend/src/components/dashboard/TodayNotifications.tsx": "Displays a card showing parties with payments due today, with call and navigation buttons for each party. Shows loading state, empty state, or up to 5 notifications with a link to view all in reports.",
  "frontend/src/components/dashboard/UpcomingPaymentsCalendar.tsx": "Provides a date picker to view parties with payments due on a selected date. Displays party details with call and navigation buttons, and includes a 'Today' quick-select button.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Handles bulk party import from Excel files with preview, validation, and batch processing (10 parties at a time). Shows progress, success count, and failed imports with reasons.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout shell with navigation bar, branding header, and footer. Includes navigation to Dashboard, Parties, Map, Reports, Settings, and logout functionality.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Dialog form for adding or editing party details (name, address, phone, PAN, due amount). Generates unique party IDs for new parties and validates required fields.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog form for recording payments with amount, comment, and optional next payment date. Requires next payment date when amount is zero.",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment records with payment ID, location indicator, and next payment date indicator. Shows a message when no payments exist.",
  "frontend/src/components/settings/PrincipalDisplayCard.tsx": "Card component that displays the user's Internet Identity Principal ID with a copy-to-clipboard button. Includes instructions for sharing with administrators to grant admin access.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "Provides UI for exporting all application data to JSON and importing JSON data with merge or overwrite modes. Uses custom hooks for data transfer operations.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog form for recording party visits with amount, comment, next payment date, visit datetime, and automatic geolocation capture. Validates that next payment date is required when amount is zero.",
  "frontend/src/context/ActorSessionContext.tsx": "React context that provides the backend actor instance, loading states, error handling, and a stable principal key for query invalidation across the application.",
  "frontend/src/context/AppReadinessContext.tsx": "Empty file with no content.",
  "frontend/src/context/StaffAuthContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/queries/useAdminPrincipals.ts": "React Query hooks for managing admin principals including fetching the list, adding, removing, and checking if the caller is an admin. Uses temporary type extensions until backend interface is regenerated.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the current user's profile (name) using the backend actor.",
  "frontend/src/hooks/queries/useBranding.ts": "React Query hooks for fetching and updating shop branding information including name and logo using the backend actor.",
  "frontend/src/hooks/queries/useMapLocationData.ts": "React Query hook that fetches party visit location data filtered by date range, processing parties with visits to extract geographic coordinates and visit counts for map display. Includes extensive logging for debugging.",
  "frontend/src/hooks/queries/useParties.ts": "React Query hooks for party management including fetching all parties, getting individual party details, validating/generating party IDs, and adding/updating/deleting parties with comprehensive error handling and cache invalidation.",
  "frontend/src/hooks/queries/usePayments.ts": "React Query hooks for payment operations including fetching party visit records, recording payments, and recording party visits with location data, invalidating related queries on success.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Empty file with no content.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "Stub file indicating staff authentication has been removed; exports no-op hooks that return null/empty values.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "React Query hook that aggregates today's visit entries across all parties, calculating total visits and amounts with automatic refresh every minute.",
  "frontend/src/hooks/queries/useTodayNotifications.ts": "React Query hook that fetches parties with payments due today, enriching them with party names and phone numbers, with automatic minute-based refresh.",
  "frontend/src/hooks/queries/useTransfer.ts": "React Query mutations for exporting and importing upgrade data, invalidating all related queries after successful import.",
  "frontend/src/hooks/queries/useUpcomingPayments.ts": "React Query hook that fetches parties with upcoming payments for a selected date by analyzing visit records and filtering by next payment date.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useActorSafe.ts": "Alternative actor hook with explicit error handling, retry logic, and exposed loading/error states without automatic query invalidation.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Simplified stub hook for due-today alerts with dismissal functionality; actual implementation disabled to avoid performance issues from fetching all party payment records.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useStaffAuth.ts": "Empty file, likely a placeholder for staff authentication logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like buttons, cards, borders, and charts.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "CSV parser that reads party data from uploaded files, validates required fields (Party Name, PAN), enforces length limits, and returns parsed parties with errors.",
  "frontend/src/lib/format.ts": "Utility functions for formatting and parsing money (bigint to INR string), phone numbers, and PAN numbers with fallback display values.",
  "frontend/src/lib/phone.ts": "Helper functions to normalize phone numbers and create tel: links for click-to-call functionality.",
  "frontend/src/lib/time.ts": "Time conversion utilities between JavaScript Date objects and ICP Time (nanoseconds as bigint), plus formatting functions for datetime-local inputs and display.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Functions to export/import UpgradeData as JSON files with bigint serialization, including merge logic for combining existing and incoming party/visit data.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AllPartiesListPage.tsx": "Page component displaying an alphabetically sorted list of all parties with their addresses and phone numbers, including loading and error states.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing today's visit statistics, received amounts, notifications, upcoming payments calendar, and a list of recent visits with quick actions.",
  "frontend/src/pages/DuplicatePartiesPage.tsx": "Displays a page that identifies and groups parties with duplicate names (case-insensitive), showing alerts and detailed cards for each duplicate group with party information and balances.",
  "frontend/src/pages/MapPage.tsx": "Renders an interactive Leaflet map with marker clustering that displays party visit locations, includes date range filtering, and dynamically loads Leaflet and MarkerCluster libraries from CDN.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Provides a searchable party selection interface for creating new party visits, displaying party cards that open a PartyVisitFormDialog when clicked.",
  "frontend/src/pages/PartiesPage.tsx": "Main parties listing page with search functionality, displays party cards in a grid, and includes an add party button that opens PartyFormDialog.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Shows detailed information for a single party including contact details, balance, payment history, and action buttons for editing, deleting, adding payments, and recording visits.",
  "frontend/src/pages/ReportsPage.tsx": "Advanced reports page that displays detailed payment history and analytics for selected parties, with search/filter functionality and comprehensive visit record visualization including location data and payment trends.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with tabbed interface for profile, branding, import, data transfer, data health tools (including duplicate detection), and admin panel (for authorized users).",
  "frontend/src/pages/VisitDetailsPage.tsx": "Displays detailed information for a specific party visit/payment record, including amount, date/time, comments, next payment date, and location data with map link.",
  "frontend/src/utils/staffSession.ts": "Empty utility file for staff session management (no implementation present).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, container queries, typography plugin, and custom animations.",
  "project_state.json": "Project metadata tracking two existing features: creating a comprehensive party list page and investigating/resolving data duplication issues for party records."
}