{
  "backend/main.mo": "Main Motoko actor implementing party ledger backend with CRUD operations for parties, payments, visit records, shop branding, user profiles, and admin/staff authorization using access control mixins and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: dashboard notifications for today's visits with call buttons (REQ-1) and Reports page search filtering by party name/phone/PAN (REQ-2).",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering routing, hooks, utilities, components, and pages with details on caching strategies, authentication, and UI functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including sidebar, chart, and UI component colors.",
  "frontend/index.html": "HTML entry point for the Party Ledger application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring React Query, TanStack Router with routes for dashboard, parties, reports, settings, visits, and map, plus theme provider and error boundary.",
  "frontend/src/components/admin/AddAdminPrincipalDialog.tsx": "Dialog component for adding new admin principals with Principal ID validation, form submission, and error handling using React Query mutation.",
  "frontend/src/components/admin/AdminPrincipalsPanel.tsx": "Admin panel displaying list of admin principals with add/remove functionality, current user indication, and protection against removing the last admin.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Component for managing staff users with add/remove capabilities (content truncated in source).",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Alert dialog component that displays parties with payments due today, allowing users to view individual party details by navigating to their page.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen card component displaying an access denied message with an optional custom reason for permission failures.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen shown when application initialization fails, providing retry and reload page options.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen component with Internet Identity authentication, featuring a branded card layout with login button.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Error screen specifically for profile loading failures, offering retry and reload functionality.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup, collecting the user's name with form validation and submission handling.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Empty file placeholder for admin password reset dialog component.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Empty file placeholder for staff-specific login screen component.",
  "frontend/src/components/auth/StartupLoadingScreen.tsx": "Simple loading screen with spinner and customizable message displayed during application startup.",
  "frontend/src/components/auth/TopLevelErrorBoundary.tsx": "React error boundary component that catches top-level errors and displays a self-contained error UI with reload functionality.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Header component displaying shop logo and name from branding settings, with fallback to default values.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card for managing shop branding including name and logo upload with progress tracking using ExternalBlob.",
  "frontend/src/components/dashboard/TodayNotifications.tsx": "Dashboard card component showing parties with payments due today, including call buttons with phone links and loading/empty states.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Card component for importing parties from Excel files with batch processing, progress tracking, and error handling. Parses Excel data, generates party IDs, and adds parties in batches of 10.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout shell with navigation bar, branding header, and footer. Provides navigation to Dashboard, Parties, New Visit, Map, Reports, and Settings pages with logout functionality.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Dialog form for adding or editing party records with fields for name, address, phone, PAN, and due amount. Handles party ID generation and validation before submission.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog form for recording payments with amount, comment, and optional next payment date fields. Requires next payment date when amount is zero.",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment records with metadata including payment ID, next payment date indicator, and location saved status.",
  "frontend/src/components/settings/PrincipalDisplayCard.tsx": "Card component that displays the user's Internet Identity Principal ID with copy-to-clipboard functionality for sharing with administrators.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "Card component for exporting and importing application data as JSON with options to merge or overwrite existing data.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog component for recording party visits with payment amount, comment, next payment date, visit date/time, and optional geolocation capture. Validates that next payment date is required when amount is zero.",
  "frontend/src/context/ActorSessionContext.tsx": "React context provider that wraps the actor (backend interface) and exposes actor state, loading flags, error handling, and a stable principal key for query invalidation.",
  "frontend/src/context/AppReadinessContext.tsx": "Empty file with no content.",
  "frontend/src/context/StaffAuthContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/queries/useAdminPrincipals.ts": "React Query hooks for managing admin principals: fetching list, adding, removing, and checking if caller is admin. Uses temporary extended actor interface until backend bindings are regenerated.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the caller's user profile (name). Includes retry and stale-time configuration.",
  "frontend/src/hooks/queries/useBranding.ts": "React Query hooks for fetching and setting shop branding (name and logo as ExternalBlob). Includes cache invalidation on mutation.",
  "frontend/src/hooks/queries/useMapLocationData.ts": "React Query hook that fetches all parties with visit records, extracts location data from visits, and returns map-ready data with party info, coordinates, and visit counts.",
  "frontend/src/hooks/queries/useParties.ts": "React Query hooks for party management: fetching all parties, fetching single party, validating/generating party IDs with detailed logging, and adding parties with cache invalidation.",
  "frontend/src/hooks/queries/usePayments.ts": "React Query hooks for payment operations: fetching party visit record metadata, recording payments, and recording party visits with location. Invalidates multiple related queries on success.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Empty file with no content.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "Stub file indicating staff authentication has been removed; exports no-op hooks for backward compatibility.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "React Query hook that aggregates today's visits across all parties, sorts by payment date, calculates total amount, and returns structured dashboard data with auto-refresh every minute.",
  "frontend/src/hooks/queries/useTodayNotifications.ts": "React Query hook that fetches parties with payments due today, with automatic refresh every minute and refetch on window focus.",
  "frontend/src/hooks/queries/useTransfer.ts": "Provides React Query mutations for exporting and importing upgrade data (parties, payments, branding) with cache invalidation on successful import.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Similar to useActor but with retry logic and additional error handling states for safer actor initialization.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Simplified hook for managing due-today alerts; currently returns empty state as full implementation would be expensive without backend support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout with delegation identity management and session persistence.",
  "frontend/src/hooks/useStaffAuth.ts": "Empty file, likely placeholder for staff authentication logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, spacing, and chart colors using HSL color space.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "Parses CSV files to extract party data (name, address, phone, PAN, due amount) with validation, error reporting, and detailed debug logging.",
  "frontend/src/lib/format.ts": "Utility functions for formatting and parsing money (with Indian rupee symbol), phone numbers, and PAN numbers.",
  "frontend/src/lib/phone.ts": "Normalizes phone numbers and creates tel: links for click-to-call functionality.",
  "frontend/src/lib/time.ts": "Converts between Date objects and nanosecond timestamps, formats dates/times, and handles datetime-local input strings.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Handles JSON export/import of upgrade data with bigint serialization, file download, and merge logic for combining existing and incoming data.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Displays today's dashboard with visit count, total amount collected, notifications, and a list of today's party visits with navigation and call actions.",
  "frontend/src/pages/MapPage.tsx": "Displays an interactive Leaflet map showing party locations with markers, loads Leaflet from CDN, and allows navigation to party details by clicking markers or visit counts.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Provides a searchable grid of party cards for selecting a party to record a new visit, opens PartyVisitFormDialog on selection.",
  "frontend/src/pages/PartiesPage.tsx": "Lists all parties in a searchable grid with add/edit functionality via PartyFormDialog, allows navigation to individual party details.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Shows detailed party information with edit/delete actions, displays payment history, and provides dialogs for adding payments and visits.",
  "frontend/src/pages/ReportsPage.tsx": "Displays payment history and analytics for a selected party with search functionality, showing visit records and latest payment details.",
  "frontend/src/pages/SettingsPage.tsx": "Tabbed settings interface for profile, branding, Excel import, data transfer, and admin panel (conditionally shown for admin users).",
  "frontend/src/pages/VisitDetailsPage.tsx": "React page component that displays detailed information about a specific party visit record, including amount, date/time, location, and comments, with navigation back to dashboard.",
  "frontend/src/utils/staffSession.ts": "Empty utility file for staff session management.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project metadata tracking existing features (dashboard notifications, reports search) and pending feature requests for a CRM/Dashboard application with customer visit tracking functionality."
}