{
  "backend/main.mo": "Motoko canister implementing party, payment, staff account, and branding management with storage and authorization mixins and various filtering and comparison utilities.",
  "feature_evidence.json": "Feature evidence report mapping performance-related features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files including hooks, components, utilities, and pages.",
  "frontend/index.css": "Tailwind CSS base stylesheet defining light/dark theme CSS variables and applying global styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app defining routes, authentication flow, profile setup, readiness gating, and due-today alert activation.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Admin panel for listing, creating, editing, disabling, and resetting passwords for staff accounts with dialog-driven UI.",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Displays an alert dialog listing parties with payments due today and allows navigating to each party.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access‑denied message with an optional reason when a user lacks permissions.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Presents an initialization failure message with a retry button.",
  "frontend/src/components/auth/LoginScreen.tsx": "Provides the main login screen using Internet Identity with a simple login button.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Shows an error screen when loading a user profile fails, offering a retry action.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting the user to enter and save their name during initial profile setup.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Dialog for resetting the admin password with validation, mutation handling, and error feedback.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Staff login form supporting error messages, success state, and admin password reset flow.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Displays the shop’s branding header with logo and name fetched from backend branding data.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card allowing users to update the shop name and upload a new logo with progress tracking.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Allows users to upload a CSV file, preview parsed party data, and import parties with generated IDs while handling errors and progress states.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with navigation, branding header, logout handling, and a footer.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Dialog for adding or editing party records, including ID generation, validation, and submit handling.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog for recording a payment with amount, comment, and optional next payment date validation.",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment history records with icons indicating next payment dates and location data.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "UI for exporting all app data to JSON and importing data with merge or overwrite modes.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog form for recording a party visit, handling amount, dates, geolocation capture, and submitting via useRecordPartyVisit.",
  "frontend/src/context/ActorSessionContext.tsx": "Provides actor session state and loading/error info using useActorSafe.",
  "frontend/src/context/AppReadinessContext.tsx": "Determines overall app readiness based on II identity, actor availability, and staff authentication.",
  "frontend/src/context/StaffAuthContext.tsx": "Context wrapper exposing staff auth state and login/logout from useStaffAuth.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the caller's user profile via the actor.",
  "frontend/src/hooks/queries/useBranding.ts": "Hooks for retrieving and updating shop branding data through the actor.",
  "frontend/src/hooks/queries/useParties.ts": "CRUD and lookup hooks for party data, gated by app readiness and actor availability.",
  "frontend/src/hooks/queries/usePayments.ts": "Hooks for fetching payment records and recording payments or visits, with cache invalidation.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Admin-focused hooks for listing, creating, updating, disabling staff accounts, and resetting admin password.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "Fetches a staff account’s permissions, falling back to defaults if unauthorized.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "Builds today's visit dashboard by fetching all parties and filtering visit records for the current day.",
  "frontend/src/hooks/queries/useTransfer.ts": "Provides export and import mutations for upgrade data and invalidates related queries on import.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorSafe.ts": "Creates a backend actor with retry logic and exposes loading and error states.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Maintains a simplified placeholder alert for parties due today with dismiss functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage identity loading, login, and state.",
  "frontend/src/hooks/useStaffAuth.ts": "Handles staff authentication using the actor, persists session state, and manages admin checks.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "Parses CSV files into party records, validates required fields, and collects errors.",
  "frontend/src/lib/format.ts": "Provides helpers for formatting and parsing money, phone numbers, and PAN values.",
  "frontend/src/lib/phone.ts": "Offers utilities to normalize phone numbers and generate tel: links.",
  "frontend/src/lib/time.ts": "Converts between Date and Time types and formats dates and datetimes.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Handles JSON export/import of upgrade data and merges imported data with existing state.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays today's visits and payments with summary cards and a detailed visit list using data from useTodayDashboard.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Allows selecting and searching parties to create a new visit, showing a dialog to record the visit.",
  "frontend/src/pages/PartiesPage.tsx": "Lists all parties with search and navigation, and provides a dialog to add new parties.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Shows full details for a party including payments and visits, with options to edit, delete, or add payments/visits.",
  "frontend/src/pages/ReportsPage.tsx": "Provides reporting for selected parties, showing summaries and full payment history using actor queries.",
  "frontend/src/pages/SettingsPage.tsx": "Renders settings tabs for branding, import, data transfer, and admin tools based on staff permissions.",
  "frontend/src/pages/VisitDetailsPage.tsx": "React page that loads a party and a specific visit record via queries and displays amount, dates, comments, and optional location with UI components.",
  "frontend/src/utils/staffSession.ts": "Utility for storing, retrieving, and clearing staff login session data and checking admin accounts.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending theme colors, fonts, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "JSON snapshot describing the project’s state, features, issues, and architectural notes for the party ledger app."
}