{
  "backend/main.mo": "Main Motoko actor implementing a party ledger system with payment tracking, location-based visit records, shop branding, staff accounts, access control, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting the shop branding name update feature with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including hooks, pages, components, utilities, and authentication logic.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using oklch color space.",
  "frontend/index.html": "HTML entry point for the Party Ledger React application with viewport meta tag and root div.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, Internet Identity authentication flow, profile setup dialog, and conditional rendering based on authentication and actor session state.",
  "frontend/src/components/admin/AddAdminPrincipalDialog.tsx": "Dialog component for adding new admin principals with Principal ID validation and mutation handling.",
  "frontend/src/components/admin/AdminPrincipalsPanel.tsx": "Admin panel displaying list of admin principals with add/remove functionality, restricted to admin users only.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Component for managing staff accounts (file content truncated in input).",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Dialog component that displays parties with payments due today, allowing users to view individual party details by navigating to the party page.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen component displaying an access denied message with an optional custom reason for permission failures.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen shown when application initialization fails, providing retry and reload options.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen component that uses Internet Identity authentication with a branded card layout.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Error screen specifically for profile loading failures, offering retry and reload functionality.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to enter their name during initial profile setup, cannot be dismissed.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Empty file placeholder for admin password reset dialog component.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Empty file placeholder for staff-specific login screen component.",
  "frontend/src/components/auth/StartupLoadingScreen.tsx": "Simple loading screen with spinner and customizable message displayed during application startup.",
  "frontend/src/components/auth/TopLevelErrorBoundary.tsx": "React error boundary component that catches top-level errors and displays a self-contained error UI with reload functionality.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Header component displaying shop logo and name from branding settings, with fallback to default values.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card for managing shop branding including name and logo upload with progress tracking using ExternalBlob.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Card component for importing parties from CSV files, with preview validation and batch import functionality that generates party IDs.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell component providing navigation bar with menu items (Dashboard, Parties, New Visit, Reports, Settings), logout functionality, and footer with branding. Wraps child content with consistent layout structure.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Dialog form for adding or editing party records with fields for name, address, phone, PAN, and due amount. Handles party ID generation for new parties and validation before submission.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog form for recording payments with amount, comment, and optional next payment date fields. Requires next payment date when amount is zero.",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment records with metadata including payment ID, next payment date indicator, and location saved status. Shows empty state when no payments exist.",
  "frontend/src/components/settings/PrincipalDisplayCard.tsx": "Card component displaying the user's Internet Identity Principal ID with copy-to-clipboard functionality. Used for sharing with administrators to grant access.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "Card component for exporting all data to JSON file and importing data with merge or overwrite modes. Handles file parsing and data merging logic.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog form for recording party visits with payment amount, comment, visit date/time, next payment date, and automatic geolocation capture. Initializes visit time to current datetime and attempts to get GPS coordinates on open.",
  "frontend/src/context/ActorSessionContext.tsx": "Provides React context for managing backend actor session state, including loading states, errors, and authentication status with a stable principal key for query invalidation.",
  "frontend/src/context/AppReadinessContext.tsx": "Empty file with no content.",
  "frontend/src/context/StaffAuthContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/queries/useAdminPrincipals.ts": "React Query hooks for managing admin principals (get, add, remove) and checking admin status, with temporary type casting until backend bindings are regenerated.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the current user's profile (name) with 5-minute cache.",
  "frontend/src/hooks/queries/useBranding.ts": "React Query hooks for getting and setting shop branding (name and logo) with 5-minute cache.",
  "frontend/src/hooks/queries/useParties.ts": "React Query hooks for CRUD operations on parties (customers), including validation and ID generation, with 2-minute cache.",
  "frontend/src/hooks/queries/usePayments.ts": "React Query hooks for fetching party visit records and recording payments/visits with location tracking, invalidating related queries on success.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Empty file with no content.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "React Query hook for fetching staff account permissions, with fallback to basic permissions if unauthorized.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "React Query hook that aggregates today's party visits across all parties, calculating total count and amount with 30-second cache and 1-minute auto-refresh.",
  "frontend/src/hooks/queries/useTransfer.ts": "React Query hooks for exporting and importing upgrade data, invalidating all data queries after import.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances based on Internet Identity authentication, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Similar to useActor but without automatic query invalidation side effects, providing a safer actor instance with retry logic and explicit error handling.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Simplified hook for managing due-today alerts, currently disabled to avoid performance issues; returns empty parties list and dismiss handler.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useStaffAuth.ts": "Empty file, likely a placeholder for staff authentication logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like cards, buttons, and charts.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "Parses CSV files to extract party data (name, address, phone, PAN, due amount) with validation and error reporting for bulk party imports.",
  "frontend/src/lib/format.ts": "Utility functions for formatting and parsing monetary amounts in Indian Rupees, phone numbers, and PAN numbers.",
  "frontend/src/lib/phone.ts": "Utility functions to normalize phone numbers and create tel: links for click-to-call functionality.",
  "frontend/src/lib/time.ts": "Time conversion utilities between JavaScript Date objects and ICP Time (nanoseconds), plus formatting functions for datetime-local inputs and display.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Handles JSON export/import of UpgradeData (parties, visit records, branding) with bigint serialization and merge logic for data transfer.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying today's visit summary with count and total amount collected, plus a list of all visits with party details and navigation.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Page for creating new party visits with searchable party list and dialog form for recording visit details when a party is selected.",
  "frontend/src/pages/PartiesPage.tsx": "Displays a searchable list of all parties with cards showing name, phone, PAN, and due amount. Includes add party dialog and navigation to individual party details.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Shows detailed information for a single party including contact info, due amount, and payment history. Provides actions for editing, deleting, making calls, recording visits, and adding payments.",
  "frontend/src/pages/ReportsPage.tsx": "Displays payment history and analytics for a selected party, showing party summary, latest payment details, and full visit records with amounts and dates.",
  "frontend/src/pages/SettingsPage.tsx": "Tabbed settings interface with sections for profile, branding, Excel import, data transfer, and admin panel (conditionally shown for admin users).",
  "frontend/src/pages/VisitDetailsPage.tsx": "Displays detailed information about a specific party visit including amount, date/time, comments, next payment date, and location with map link.",
  "frontend/src/utils/staffSession.ts": "Empty utility file, likely placeholder for staff session management functionality.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme colors using OKLCH color space, container settings, border radius variables, Inter font family, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata file tracking the shop management system for RK Brothers Lubricants and Tyre Suppliers, including schema version, existing features (shop branding update), and project configuration settings."
}