{
  "backend/main.mo": "Main Motoko actor implementing a party ledger system with CRUD operations for parties, payments, visit records, shop branding, user profiles, and location-based filtering with pagination and aggregation capabilities.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: default date range filter set to today's date on MapPage load, and a search button to trigger map data filtering.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering routing, React Query hooks, utility functions, components for layout/branding/auth/alerts, and pages for parties/reports/settings/visits/map functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, cards, and charts.",
  "frontend/index.html": "HTML entry point that includes Leaflet and Leaflet MarkerCluster CSS dependencies for map functionality and mounts the React app at #root.",
  "frontend/src/App.tsx": "Root React component configuring React Query, TanStack Router with routes for dashboard/parties/reports/settings/visits/map, theme provider, actor session context, and error boundary.",
  "frontend/src/components/admin/AddAdminPrincipalDialog.tsx": "Dialog component for adding new admin principals with Principal ID validation, form submission handling, and loading states using React Query mutation.",
  "frontend/src/components/admin/AdminPrincipalsPanel.tsx": "Admin panel displaying a table of admin principals with add/remove functionality, current user highlighting, and protection against removing the last admin.",
  "frontend/src/components/admin/StaffManagementPanel.tsx": "Component for managing staff members (file content truncated in input).",
  "frontend/src/components/alerts/DueTodayDialog.tsx": "Alert dialog component that displays parties with payments due today, allowing users to view party details by clicking on them or navigating via a View button.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen card component that displays an access denied message with an optional custom reason when users lack required permissions.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen shown when application initialization fails, providing retry and page reload options.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen component with Internet Identity authentication, displaying a branded card with login button and loading state.",
  "frontend/src/components/auth/ProfileBootstrapErrorScreen.tsx": "Error screen specifically for profile loading failures, offering retry and reload functionality.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup, collecting the user's name with form validation and submission handling.",
  "frontend/src/components/auth/ResetAdminPasswordDialog.tsx": "Empty file placeholder for admin password reset dialog component.",
  "frontend/src/components/auth/StaffLoginScreen.tsx": "Empty file placeholder for staff-specific login screen component.",
  "frontend/src/components/auth/StartupLoadingScreen.tsx": "Simple loading screen with spinner and customizable message displayed during application startup.",
  "frontend/src/components/auth/TopLevelErrorBoundary.tsx": "React error boundary component that catches top-level errors and displays a self-contained error UI with reload functionality, using inline styles to avoid dependency on app providers.",
  "frontend/src/components/branding/BrandingHeader.tsx": "Header component displaying shop logo and name from branding settings, with fallback to default values.",
  "frontend/src/components/branding/BrandingSettingsCard.tsx": "Settings card for managing shop branding including name input and logo upload with progress tracking, using ExternalBlob for file handling.",
  "frontend/src/components/dashboard/TodayNotifications.tsx": "Dashboard card component that displays parties with payments due today, showing loading state, empty state, or a list of parties with call buttons.",
  "frontend/src/components/dashboard/UpcomingPaymentsCalendar.tsx": "Displays a calendar-based view of upcoming payments with date selection, showing parties with payments due on the selected date. Includes phone call links and navigation to party details.",
  "frontend/src/components/import/ExcelPartyImportCard.tsx": "Provides Excel/CSV file import functionality for bulk party creation with preview, validation, batch processing, and detailed success/failure reporting.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout component with navigation bar, branding header, footer with caffeine.ai attribution, and logout functionality.",
  "frontend/src/components/parties/PartyFormDialog.tsx": "Modal dialog for adding or editing party information including name, address, phone, PAN, and due amount with automatic party ID generation.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Modal dialog for recording payments with amount, comment, and optional next payment date fields, requiring next payment date when amount is zero.",
  "frontend/src/components/payments/PaymentHistory.tsx": "Displays a list of payment records with metadata including payment ID, next payment date indicator, and location saved status.",
  "frontend/src/components/settings/PrincipalDisplayCard.tsx": "Shows the user's Internet Identity Principal ID with copy-to-clipboard functionality for sharing with administrators.",
  "frontend/src/components/transfer/JsonTransferCard.tsx": "React component providing UI for exporting and importing application data as JSON, with options to merge or overwrite existing data.",
  "frontend/src/components/visits/PartyVisitFormDialog.tsx": "Dialog component for recording party visits with payment amount, date/time, next payment date, comments, and automatic geolocation capture.",
  "frontend/src/context/ActorSessionContext.tsx": "React context providing actor session state (backend interface, loading states, errors) and a stable principal key for query invalidation.",
  "frontend/src/context/AppReadinessContext.tsx": "Empty file, likely a placeholder for application readiness state management.",
  "frontend/src/context/StaffAuthContext.tsx": "Empty file, likely a placeholder for staff authentication context.",
  "frontend/src/hooks/queries/useAdminPrincipals.ts": "React Query hooks for managing admin principals (get, add, remove) and checking if caller is admin, with temporary extended actor interface.",
  "frontend/src/hooks/queries/useAuth.ts": "React Query hooks for fetching and saving the caller's user profile (name) with caching and invalidation.",
  "frontend/src/hooks/queries/useBranding.ts": "React Query hooks for getting and setting shop branding (name and logo) with caching.",
  "frontend/src/hooks/queries/useMapLocationData.ts": "React Query hook that fetches parties with visit location data for map visualization, filtering by date range and requiring authentication.",
  "frontend/src/hooks/queries/useParties.ts": "React Query hooks for party CRUD operations including fetching all parties, getting single party details, validating/generating party IDs, and adding parties.",
  "frontend/src/hooks/queries/usePayments.ts": "React Query hooks for fetching party payment metadata and recording payments/visits, with automatic cache invalidation for related queries.",
  "frontend/src/hooks/queries/useStaffAdmin.ts": "Empty file with no content.",
  "frontend/src/hooks/queries/useStaffPermissions.ts": "Stub implementation indicating staff authentication has been removed; returns no-op hooks for permissions and authentication.",
  "frontend/src/hooks/queries/useTodayDashboard.ts": "React Query hook that aggregates today's visit records across all parties, calculating total visits and amounts with automatic refresh.",
  "frontend/src/hooks/queries/useTodayNotifications.ts": "React Query hook that fetches parties with payments due today, refreshing every minute.",
  "frontend/src/hooks/queries/useTransfer.ts": "React Query mutations for exporting and importing upgrade data with cache invalidation on import.",
  "frontend/src/hooks/queries/useUpcomingPayments.ts": "React Query hook that fetches parties with next payment dates matching a selected date, sorted by party name.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Alternative actor hook with explicit error handling and retry logic, without automatic query invalidation.",
  "frontend/src/hooks/useDueTodayAlert.ts": "Simplified stub hook for due-today alerts with dismissal functionality; full implementation disabled for performance reasons.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and session lifecycle.",
  "frontend/src/hooks/useStaffAuth.ts": "Empty file with no content.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, and chart color definitions.",
  "frontend/src/lib/excel/parsePartiesFromExcel.ts": "CSV parser that extracts party data (name, address, phone, PAN, due amount) from uploaded files with validation and error reporting.",
  "frontend/src/lib/format.ts": "Provides formatting and parsing utilities for money (bigint to INR string), phone numbers, and PAN identifiers.",
  "frontend/src/lib/phone.ts": "Contains utilities to normalize phone numbers and create tel: links for clickable phone numbers.",
  "frontend/src/lib/time.ts": "Handles conversion between JavaScript Date objects and backend Time (bigint nanoseconds), plus formatting and datetime-local input string utilities.",
  "frontend/src/lib/transfer/jsonTransfer.ts": "Implements JSON export/import for UpgradeData with bigint serialization, file download, parsing, and merge logic for parties and visit records.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "Displays today's dashboard with visit count, total amount collected, notifications, upcoming payments calendar, and a list of today's visits with navigation to party details.",
  "frontend/src/pages/MapPage.tsx": "Renders an interactive Leaflet map with marker clustering showing party visit locations, filterable by date range, with dynamic loading of Leaflet and MarkerCluster libraries from CDN.",
  "frontend/src/pages/NewPartyVisitPage.tsx": "Provides a searchable party selection interface to initiate recording a new visit, opening a PartyVisitFormDialog when a party is selected.",
  "frontend/src/pages/PartiesPage.tsx": "Lists all parties with search functionality, displays party cards with due amounts, and provides buttons to add new parties or navigate to party detail pages.",
  "frontend/src/pages/PartyDetailsPage.tsx": "Displays detailed information for a single party including contact details, balance, payment history, and provides actions to edit, delete, add payments, or record visits.",
  "frontend/src/pages/ReportsPage.tsx": "Shows payment history and analytics for selected parties with search functionality to filter parties by name, phone, or PAN.",
  "frontend/src/pages/SettingsPage.tsx": "Tabbed settings interface for profile, branding, data import, data transfer, and admin panel (for admin users only).",
  "frontend/src/pages/VisitDetailsPage.tsx": "Displays detailed information about a specific party visit including amount, date/time, comments, next payment date, and location.",
  "frontend/src/utils/staffSession.ts": "Empty utility file for staff session management (no content).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, container settings, typography plugin, and custom animations for accordion components.",
  "project_state.json": "Project state tracking document indicating a party map application with date filtering features, including two pending feature requests for default date filtering and search button functionality."
}