{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove all authentication guards from party ID generation",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Test that the PartyFormDialog component can successfully generate party IDs and create parties without encountering authorization errors",
      "acceptanceCriteria": [
        "The 'Add Party' dialog successfully generates party IDs",
        "Party creation completes without 'Unauthorized' errors",
        "Users can create parties immediately after opening the app"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/useParties.ts",
          "operation": "modify",
          "description": "Update the useValidateAndGeneratePartyId hook to handle both authenticated and anonymous actors. Remove any frontend-side authentication checks that may prevent party ID generation. Ensure error handling gracefully manages any residual backend errors during the transition period."
        },
        {
          "path": "frontend/src/components/parties/PartyFormDialog.tsx",
          "operation": "modify",
          "description": "Verify that the party form dialog can call validateAndGeneratePartyId without requiring authentication. Remove any UI-level authentication guards that block party ID generation or party creation. Ensure the dialog displays appropriate error messages if backend issues occur."
        },
        {
          "path": "frontend/src/hooks/queries/useParties.ts",
          "operation": "modify",
          "description": "Update the useAddParty mutation to work with both authenticated and anonymous users. Remove any frontend authentication requirements for adding parties. Ensure proper error handling and user feedback for successful and failed party creation attempts."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review the main app routing and authentication flow to ensure unauthenticated users can access party creation features. If there are route guards or conditional rendering that block party creation for anonymous users, adjust them to allow public access to party management features while preserving authentication for admin-only functions."
        }
      ]
    }
  ]
}