{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Default map to today's data with search button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Set the map date range filter to default to today's date when MapPage initially loads",
      "acceptanceCriteria": [
        "When MapPage loads, the date range inputs show today's date",
        "Map displays only parties with visits from today by default",
        "No user interaction required to see today's data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MapPage.tsx",
          "operation": "modify",
          "description": "Initialize the startDate and endDate state variables to today's date using new Date() instead of null values. This ensures the date inputs display today's date on initial load and the useMapLocationData hook fetches only today's visit data by default."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a search button next to the date range inputs that triggers the map data filter when clicked",
      "acceptanceCriteria": [
        "A search button appears in the MapPage date filter controls",
        "Clicking the search button updates the map with the selected date range",
        "Map data only updates when the search button is clicked, not automatically on date input change"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MapPage.tsx",
          "operation": "modify",
          "description": "Add a search button to the date filter UI controls section. Introduce a separate internal state for the pending date selections (pendingStartDate and pendingEndDate) that updates as the user changes the date inputs. The actual startDate and endDate state variables (used by useMapLocationData) should only update when the search button is clicked. This decouples the input changes from the map data fetching, ensuring the map only refreshes on explicit search button click. Position the search button next to the date inputs in the existing filter controls layout."
        }
      ]
    }
  ]
}