{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Party Ledger - Faster startup by gating data fetches and centralizing actor readiness",
  "requirements": [
    {
      "id": "REQ-51",
      "summary": "Gate parties/payments-driven queries (including due-today alert and dashboard) until both Internet Identity and staff authentication are complete, preventing any early data fetching.",
      "acceptanceCriteria": [
        "When the user is not authenticated with Internet Identity, the app does not start fetching parties/payments for alerts/dashboard/screens.",
        "When the user is authenticated with Internet Identity but not yet staff-authenticated, the app does not start fetching parties/payments for alerts/dashboard/screens.",
        "After staff login succeeds, the main screens load data normally and the due-today alert can run without requiring a manual refresh.",
        "No additional network calls are triggered by the due-today alert hook while it is effectively disabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/context/AppReadinessContext.tsx",
          "operation": "create",
          "description": "Create an app-readiness context that derives and exposes readiness flags (e.g., isIIAuthenticated, isActorReady, isStaffAuthenticated, isAppReadyForMainData) to allow hooks/components to gate queries until the app is ready to show main content."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Use the new app-readiness context to ensure only the post-staff-login portion of the app enables main-data hooks; keep Login/Profile/Staff Login flows functional while preventing early parties/payments fetching. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/queries/useParties.ts",
          "operation": "modify",
          "description": "Add support for an explicit enabled/guard option (defaulting to current behavior) so callers can prevent parties fetching until staff authentication is complete."
        },
        {
          "path": "frontend/src/hooks/queries/usePayments.ts",
          "operation": "modify",
          "description": "Add support for an explicit enabled/guard option (defaulting to current behavior) so callers can prevent payment metadata fetching until staff authentication is complete."
        },
        {
          "path": "frontend/src/hooks/queries/useTodayDashboard.ts",
          "operation": "modify",
          "description": "Gate the today-dashboard aggregation query behind app readiness (staff-authenticated + actor ready), so it never runs during Internet Identity-only or staff-login states."
        },
        {
          "path": "frontend/src/hooks/useDueTodayAlert.ts",
          "operation": "modify",
          "description": "Refactor the due-today alert hook to fully disable itself when not app-ready (no parties query, no payment queries/loops) and to re-enable automatically after staff login succeeds, without requiring a manual refresh."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Ensure backend actor creation/initialization runs once per Internet Identity session and is shared across hooks/components, avoiding redundant bootstrap work from multiple hook mounts.",
      "acceptanceCriteria": [
        "During a normal login flow, the backend actor initialization (including access-control secret initialization) happens once per Internet Identity principal change, not multiple times due to multiple hooks mounting.",
        "Profile fetch and staff login do not each trigger their own separate actor initialization sequence.",
        "Refreshing the page while already logged in does not result in repeated initialization loops; the app reaches Staff Login (or Dashboard if staff session exists) promptly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/context/ActorSessionContext.tsx",
          "operation": "create",
          "description": "Create a single ActorSession provider that calls useActorSafe once and shares {actor, loading, error, refetch, principalKey} across the app, ensuring a single actor initialization per Internet Identity principal. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the authenticated portion of the app with ActorSessionContext so all hooks/components consume a shared actor instance instead of each calling useActorSafe independently. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/queries/useAuth.ts",
          "operation": "modify",
          "description": "Switch auth/profile React Query hooks to consume the shared actor from ActorSessionContext (not useActorSafe directly) so profile fetch and staff login do not trigger separate actor initialization work. Also follow the authorization component guidance for authenticated data access and cache clearing behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useStaffAuth.ts",
          "operation": "modify",
          "description": "Switch staff-login logic to consume the shared actor from ActorSessionContext so staff authentication does not independently trigger actor initialization work. Also ensure logout continues to clear cached application data per authorization guidance. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/queries/useParties.ts",
          "operation": "modify",
          "description": "Switch party query/mutation hooks to consume the shared actor from ActorSessionContext so list/detail screens do not re-run actor readiness checks per hook mount."
        },
        {
          "path": "frontend/src/hooks/queries/usePayments.ts",
          "operation": "modify",
          "description": "Switch payment query/mutation hooks to consume the shared actor from ActorSessionContext so payments screens do not re-run actor readiness checks per hook mount."
        },
        {
          "path": "frontend/src/hooks/queries/useBranding.ts",
          "operation": "modify",
          "description": "Switch branding queries/mutations to consume the shared actor from ActorSessionContext to avoid additional actor initialization checks during shell/header rendering."
        },
        {
          "path": "frontend/src/hooks/queries/useStaffPermissions.ts",
          "operation": "modify",
          "description": "Switch staff permission querying to consume the shared actor from ActorSessionContext to avoid redundant actor readiness checks when Settings/Admin UI mounts."
        },
        {
          "path": "frontend/src/hooks/queries/useTransfer.ts",
          "operation": "modify",
          "description": "Switch transfer export/import mutations to consume the shared actor from ActorSessionContext to avoid redundant actor readiness checks when Transfer UI mounts."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Tune React Query bootstrap to avoid broad invalidation/refetch cascades on actor readiness and prevent repeated refetch loops during initial render.",
      "acceptanceCriteria": [
        "On app start, the profile query is executed at most once per actor readiness event (no repeated rapid refetching loops).",
        "App does not trigger a blanket refetch of unrelated queries when the actor becomes available; only relevant queries refresh when needed (e.g., after mutations or explicit user actions).",
        "The UI does not get stuck on “Loading profile...” or “Initializing...” indefinitely due to repeated query churn; if a fetch fails, the existing retry/error UI remains reachable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the app bootstrap path does not rely on any hook that triggers a blanket query invalidation/refetch cascade on actor availability (avoid useActor usage patterns that cause global refetch churn), and keep existing retry/error screens reachable."
        },
        {
          "path": "frontend/src/hooks/queries/useAuth.ts",
          "operation": "modify",
          "description": "Adjust the profile query options to reduce bootstrap churn (e.g., set appropriate staleTime, disable automatic refetch-on-focus/mount where safe, keep retry behavior consistent with existing error UI) so it runs at most once per actor readiness event."
        },
        {
          "path": "frontend/src/hooks/queries/useParties.ts",
          "operation": "modify",
          "description": "Tune parties queries to avoid automatic refetch loops during initial render (e.g., set sensible staleTime/refetchOnWindowFocus defaults) while keeping mutation-driven invalidations targeted to parties-related keys only."
        },
        {
          "path": "frontend/src/hooks/queries/usePayments.ts",
          "operation": "modify",
          "description": "Tune payments queries to avoid automatic refetch loops during initial render (e.g., set sensible staleTime/refetchOnWindowFocus defaults) while keeping mutation-driven invalidations targeted to payment/party keys only."
        },
        {
          "path": "frontend/src/hooks/queries/useTodayDashboard.ts",
          "operation": "modify",
          "description": "Ensure the today-dashboard query does not refetch repeatedly during bootstrap by gating it to app readiness and setting refetch behavior to avoid rapid churn (keeping the periodic refresh only after the app is ready)."
        }
      ]
    }
  ]
}